update structure of the repo, move files to src and outputs folders, add eda notebook and outputs, add config.yaml file, update README.md files
